<?php
// описание компонента для визуального редактора 
if (!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die();

$arComponentDescription = [
    // видимое название
    "NAME" => "Таблица валют и калькулятор",
    
    // пояснение
    "DESCRIPTION" => "Выводит курсы валют с навигацией и AJAX-калькулятором",
    
    // папка, где будет лежать компонент в дереве визуального редактора
    "PATH" => [
        "ID" => "my_components",          // системный id категории
        "NAME" => "Мои компоненты",       // название категории, видимое
    ],
];