<?php
// настройки компонента (по умолчанию 2 элемента на странице)
if (!defined("B_PROLOG_INCLUDED") || B_PROLOG_INCLUDED !== true) die();

$arComponentParameters = [
    // группы параметров, пустой массив
    "GROUPS" => [],
    
    // можно менять в настройках компонента
    "PARAMETERS" => [
        // параметр PAGE_SIZE - количество элементов на странице
        "PAGE_SIZE" => [
            "PARENT" => "BASE",                        // к какой группе относится (BASE — основная)
            "NAME" => "Количество элементов на странице", // как параметр будет называться в админке
            "TYPE" => "STRING",                        // тип поля (строка)
            "DEFAULT" => "2",                          // значение по умолчанию — 2
        ],
    ],
];
